ART-Badge/SDK/bsp_for_art-badge/libraries/inc/peripheral/rtl876x_rtc.h
/**
*********************************************************************************************************
*               Copyright(c) 2020, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_rtc.h
* \brief    The header file of the peripheral RTC driver.
* \details  This file provides all RTC firmware functions.
* \author   yuan
* \date     2020-06-01
* \version  v2.1.0
* *********************************************************************************************************
*/

#ifndef _RTL876X_RTC_H_
#define _RTL876X_RTC_H_

#ifdef __cplusplus
extern "C" {
#endif

/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    RTC         RTC
 *
 * \brief       Manage the RTC peripheral functions.
 *
 * \ingroup     IO
 */


/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"
#include "rtl876x_alias.h"


/*============================================================================*
 *                         Registers Definitions
 *============================================================================*/

/* Peripheral: RTC */
/* Description: Real time counter register defines */

/* REG_RTC_SLEEP_MODE_SET[1] :RTC_NV_EN. Enable interrupt signal to MCU.  0x1: Enable. 0x0: Disable. */
#define RTC_NV_EN_Pos                   (1UL)
#define RTC_NV_EN_Msk                   (0x1UL << RTC_NV_EN_Pos)
#define RTC_NV_EN_CLR                   (~(RTC_NV_EN_Msk))

/* REG_RTC_SLEEP_MODE_SET[0] :RTC_WAKEUP_EN. Enable wakeup signal to AON register.  0x1: Enable. 0x0: Disable. */
#define RTC_WAKEUP_EN_Pos               (0UL)
#define RTC_WAKEUP_EN_Msk               (0x1UL << RTC_WAKEUP_EN_Pos)
#define RTC_WAKEUP_EN_CLR               (~(RTC_WAKEUP_EN_Msk))

/* Register: CR0 */
/* Description: RTC Control Register 0. Offset: 0x00. Address: 0x40000140. */

/* CR0[18] :RTC_INT_EN. Enable or disable prescale & comp3 interrupt.  0x1: Enable. 0x0: Disable. */
#define RTC_INT_PRE_COMP3_EN_Pos         (18UL)
#define RTC_INT_PRE_COMP3_EN_Msk         (0x1UL << RTC_INT_PRE_COMP3_EN_Pos)

/* CR0[17] :RTC_INT_EN. Enable or disable prescale comp interrupt.  0x1: Enable. 0x0: Disable. */
#define RTC_INT_PRE_COMP_EN_Pos          (17UL)
#define RTC_INT_PRE_COMP_EN_Msk          (0x1UL << RTC_INT_PRE_COMP_EN_Pos)

/* CR0[16] :RTC_INT_EN. Enable or disable tick interrupt.  0x1: Enable. 0x0: Disable. */
#define RTC_INT_TICK_EN_Pos             (16UL)
#define RTC_INT_TICK_EN_Msk             (0x1UL << RTC_INT_TICK_EN_Pos)

/* CR0[15] :RTC_INT_EN. Enable or disable compare3 interrupt.  0x1: Enable. 0x0: Disable. */
#define RTC_INT_COMP3_EN_Pos            (15UL)
#define RTC_INT_COMP3_EN_Msk            (0x1UL << RTC_INT_COMP3_EN_Pos)

/* CR0[14] :RTC_INT_EN. Enable or disable compare2 interrupt.  0x1: Enable. 0x0: Disable. */
#define RTC_INT_COMP2_EN_Pos            (14UL)
#define RTC_INT_COMP2_EN_Msk            (0x1UL << RTC_INT_COMP2_EN_Pos)

/* CR0[13] :RTC_INT_EN. Enable or disable compare1 interrupt.  0x1: Enable. 0x0: Disable. */
#define RTC_INT_COMP1_EN_Pos            (13UL)
#define RTC_INT_COMP1_EN_Msk            (0x1UL << RTC_INT_COMP1_EN_Pos)

/* CR0[12] :RTC_INT_EN. Enable or disable compare0 interrupt.  0x1: Enable. 0x0: Disable. */
#define RTC_INT_COMP0_EN_Pos            (12UL)
#define RTC_INT_COMP0_EN_Msk            (0x1UL << RTC_INT_COMP0_EN_Pos)

/* CR0[11] :RTC_MASK_TICK_INT. Mask RTC prescale & comp3 interrupt.  0x1: Unmask. 0x0: Mask. */
#define RTC_MASK_PRE_COMP3_INT_Pos       (11UL)
#define RTC_MASK_PRE_COMP3_INT_Msk       (0x1UL << RTC_MASK_PRE_COMP3_INT_Pos)

/* CR0[10] :RTC_MASK_TICK_INT. Mask RTC prescale comp interrupt.  0x1: Unmask. 0x0: Mask. */
#define RTC_MASK_PRE_COMP_INT_Pos        (10UL)
#define RTC_MASK_PRE_COMP_INT_Msk        (0x1UL << RTC_MASK_PRE_COMP_INT_Pos)

/* CR0[4] :RTC_MASK_TICK_INT. Mask RTC tick interrupt.  0x1: Unmask. 0x0: Mask. */
#define RTC_MASK_TICK_INT_Pos           (4UL)
#define RTC_MASK_TICK_INT_Msk           (0x1UL << RTC_MASK_TICK_INT_Pos)

/* CR0[2] :RTC_DIV_COUNTER_RST. Reset Prescale Counter. 0x1: Reset Counter to 0. */
#define RTC_DIV_COUNTER_RST_Pos         (2UL)
#define RTC_DIV_COUNTER_RST_Msk         (0x1UL << RTC_DIV_COUNTER_RST_Pos)
#define RTC_DIV_COUNTER_RST_CLR         (~(RTC_DIV_COUNTER_RST_Msk))

/* CR0[1] :RTC_COUNTER_RST. Reset 24bit-RTC Counter. 0x1: Reset Counter to 0. */
#define RTC_COUNTER_RST_Pos             (1UL)
#define RTC_COUNTER_RST_Msk             (0x1UL << RTC_COUNTER_RST_Pos)
#define RTC_COUNTER_RST_CLR             (~(RTC_COUNTER_RST_Msk))

/* CR0[0] :RTC_START. Start or stop RTC 24bit-RTC Counter. 0x1: Start 24bit-RTC Counter.0x0: Stop 24bit-RTC Counter. */
#define RTC_START_Pos                   (0UL)
#define RTC_START_Msk                   (0x1UL << RTC_START_Pos)
#define RTC_START_CLR                   (~(RTC_START_Msk))

/* Register: INT_CLR */
/* Description: Interrupt mask register. Offset: 0x04. Address: 0x40000144. */

/* INT_CLR[7] :RTC_PRE_COMP3_CLR. Clear Interrupt Status of prescale and prescale_comp3. */
/* This interrupt is cleared by software.write 1 then write 0 after 2T to clear. */
#define RTC_PRE_COMP3_CLR_Pos           (7UL)
#define RTC_PRE_COMP3_CLR_SET           (0x1UL << RTC_PRE_COMP3_CLR_Pos)
#define RTC_PRE_COMP3_CLR_RESET         (~(RTC_PRE_COMP3_CLR_SET))

/* INT_CLR[6] :RTC_PRE_COMP_CLR. Clear Interrupt Status of Comparator1. */
/* This interrupt is cleared by software.write 1 then write 0 after 2T to clear. */
#define RTC_PRE_COMP_CLR_Pos            (6UL)
#define RTC_PRE_COMP_CLR_SET            (0x1UL << RTC_PRE_COMP_CLR_Pos)
#define RTC_PRE_COMP_CLR_RESET          (~(RTC_PRE_COMP_CLR_SET))

/* INT_CLR[5] :RTC_COMP3_CLR. Clear Interrupt Status of Comparator1. */
/* This interrupt is cleared by software.write 1 then write 0 after 2T to clear. */
#define RTC_COMP3_CLR_Pos               (5UL)
#define RTC_COMP3_CLR_SET               (0x1UL << RTC_COMP3_CLR_Pos)
#define RTC_COMP3_CLR_RESET             (~(RTC_COMP3_CLR_SET))

/* INT_CLR[4] :RTC_COMP2_CLR. Clear Interrupt Status of Comparator1. */
/* This interrupt is cleared by software.write 1 then write 0 after 2T to clear. */
#define RTC_COMP2_CLR_Pos               (4UL)
#define RTC_COMP2_CLR_SET               (0x1UL << RTC_COMP2_CLR_Pos)
#define RTC_COMP2_CLR_RESET             (~(RTC_COMP2_CLR_SET))

/* INT_CLR[3] :RTC_COMP1_CLR. Clear Interrupt Status of Comparator1. */
/* This interrupt is cleared by software.write 1 then write 0 after 2T to clear. */
#define RTC_COMP1_CLR_Pos               (3UL)
#define RTC_COMP1_CLR_SET               (0x1UL << RTC_COMP1_CLR_Pos)
#define RTC_COMP1_CLR_RESET             (~(RTC_COMP1_CLR_SET))

